cask_args appdir: '/Applications'

tap 'homebrew/bundle'

cask 'iterm2'       # latest iterm2
cask 'rectangle'    # latest rectangle wm
cask 'discord'
cask 'slack'        # latest slack
cask 'transmission' # latest transmission
cask 'visual-studio-code'   # stable vscode
cask 'cyberduck'    # SFTP client
cask 'coconutbattery' # battery monitor

brew 'macvim'  	    # override the system vim in /usr/bin/local 
brew 'rustup-init'  # latest rustup
brew 'python'       # latest python3
brew 'node'         # latest nodejs
brew 'yarn'         # latest yarn
brew 'fzf'          # latest fzf
brew 'ripgrep'      # latest ripgrep
brew 'neofetch'     # latest neofetch
brew 'htop'         # process manager
brew 'tmux'         # terminal multiplexer


# these will install the latest releases according to brew
# you can install other versions and then symlink them to /usr/local/bin
# by using the following commands for example installing a newer version
# of python:
#
# $ brew install python
# $ brew install python@3.8
# $ brew unlink python
# $ brew link python@3.8 --force
