cask_args appdir: '/Applications'

tap 'homebrew/bundle'

cask 'iterm2'               # latest iterm2
cask 'rectangle'            # latest rectangle wm
cask 'discord'
cask 'transmission'         # latest transmission
cask 'visual-studio-code'   # stable vscode
cask 'cyberduck'            # SFTP client
cask 'dbeaver-community'    # database client
cask 'obsidian'             # markdown knowledge base tool

brew 'rclone'       # cli tool for managing cloud storage
brew 'neovim'
brew 'rustup-init'  # latest rustup
brew 'python'       # latest python3
brew 'uv'           # python package and env management
brew 'go'           # latest go
brew 'node'         # latest nodejs
brew 'fzf'          # latest fzf
brew 'ripgrep'      # latest ripgrep
brew 'neofetch'     # latest neofetch
brew 'htop'         # process manager
brew 'tmux'         # terminal multiplexer
brew 'ncdu'         # disk usage analyzer
brew 'git-delta'    # https://github.com/dandavison/delta
brew 'jq'           # CLI JSON processor
brew 'watchexec'     # trigger actions on file changes


# these will install the latest releases according to brew
# you can install other versions and then symlink them to /usr/local/bin
# by using the following commands for example installing a newer version
# of python:
#
# $ brew install python
# $ brew install python@3.8
# $ brew unlink python
# $ brew link python@3.8 --force
